#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, чтобы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечисленные.
# Порядок чисел нужно сохранить.


def compute_result():
    result = 1 * 2 + 3 + 4 * 5
    return result


def main():
    # Пример для чисел "1 2 3" и "9"
    result = (1 + 2) * 3
    print(result)

    # TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль
    print(compute_result())


if __name__ == "__main__":
    main()
