#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["Мать", "Отец", "Брат"]

# список списков приблизительного роста членов вашей семьи
my_family_height = [ ['Мать', 155], 
                     ['Отец', 180],
                     ['Брат', 182]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
for name, height in my_family_height:
    if name == "Отец":
        print(f"Рост отца - {height} см")

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
total_height = 0
for name, height in my_family_height:
    total_height += height
print(f"Общий рост моей семьи - {total_height} см")