#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# В саду сорвали цветы
garden = ('ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза', )

# На лугу сорвали цветы
meadow = ('клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка', )

# Создайте множество цветов, произрастающих в саду и на лугу
# garden_set = 
# meadow_set =
garden_set = set(garden)
meadow = set(meadow)

# Выведите на консоль все виды цветов
print(f"Все виды цветов: {garden_set | meadow}")

# Выведите на консоль те, которые растут и там и там
print(f"Все виды цветов: {garden_set & meadow}")

# Выведите на консоль те, которые растут в саду, но не растут на лугу
print(f"Все виды цветов: {garden_set - meadow}")

# Выведите на консоль те, которые растут на лугу, но не растут в саду
print(f"Все виды цветов: {meadow - garden_set}")
